{
  "name": "Avery Heights",
  "location": "Hartford, CT",
  "address": "705 New Britain Avenue, Hartford, CT 06106",
  "description": "Greater Hartford's premier rental-only CCRC nestled atop Cedar Mountain on a scenic 43-acre site, serving the area for over 50 years. Owned by not-for-profit Church Homes, Inc., Avery Heights uniquely offers full continuum care with NO buy-in fees. Features spacious apartments, New England-style cottages, state-of-the-art wellness center, and priority access to home health, assisted living, memory care, rehabilitation, and skilled nursing—all on a park-like campus.",
  "community_type": "CCRC (Continuing Care Retirement Community) - Rental Model",
  "resident_count": 175,
  "star_rating": null,
  "monthly_cost_min": 3000,
  "monthly_cost_max": 12927,
  "phone": "(860) 953-1201",
  "website": "https://averyheights.org/",
  "care_levels": [
    "Independent Living",
    "Home Health Care",
    "Assisted Living",
    "Memory Care",
    "Short-Term Rehabilitation",
    "Long-Term Skilled Nursing Care"
  ],
  "housing_options": [
    "One-Bedroom Apartments",
    "Two-Bedroom Apartments",
    "New England-Style Cottages",
    "Assisted Living Residences",
    "Skilled Nursing Rooms"
  ],
  "amenities": [
    "43-Acre Cedar Mountain Campus",
    "State-of-the-Art Wellness Center",
    "New England-Style Cottages",
    "Spacious One & Two-Bedroom Apartments",
    "Game Room",
    "Library",
    "Scenic Walking Paths",
    "Business Room",
    "Beauty Salon and Barber Shop",
    "Fitness Room with Equipment",
    "Garden Spaces",
    "Spa/Wellness Room",
    "Fitness Programs",
    "Movie Nights",
    "Resident-Run Activities",
    "Scheduled Daily Activities",
    "Community-Sponsored Activities",
    "Music Programs",
    "Priority Access to Healthcare Continuum",
    "Park-Like Setting"
  ],
  "financials_summary": "Avery Heights uniquely operates as a rental-only CCRC with NO buy-in fees, offering independent living from approximately $3,000-$6,000/month, assisted living from $3,000-$7,000/month, and skilled nursing from $3,975-$12,927/month, with priority access to the full care continuum without entrance fee requirements.",
  "care_summary": "As a Church Homes, Inc. not-for-profit CCRC serving Greater Hartford for over 50 years, Avery Heights provides priority continuum access from independent living through skilled nursing, including home health, assisted living, memory care, and short-term rehabilitation, all available without buy-in fees.",
  "housing_summary": "The 43-acre Cedar Mountain campus offers spacious one and two-bedroom apartments plus charming New England-style cottages, all featuring fully equipped kitchens, in-unit washer/dryers, cable hookups, and private balconies or patios within a park-like setting.",
  "community_summary": "Developed in the 1950s by Hartford business executives and clergy atop Cedar Mountain's scenic 43 acres, this Church Homes, Inc. not-for-profit CCRC features a state-of-the-art wellness center, library, game room, gardens, walking paths, and is the only rental-only CCRC in the area with no entrance fees required.",
  "data_confidence": {
    "address": "verified",
    "phone": "verified",
    "pricing": "high",
    "care_levels": "verified",
    "amenities": "high",
    "no_buy_in_fees": "verified",
    "campus_size": "verified"
  },
  "sources": [
    "https://averyheights.org/",
    "https://churchhomes.org/avery-heights/",
    "https://averyheights.org/about-us/",
    "Seniorly",
    "A Place for Mom (22 reviews)",
    "U.S. News Best Senior Living",
    "SeniorSite",
    "Apartments.com",
    "United Way of Central & Northeastern Connecticut"
  ],
  "notes": "CRITICAL DIFFERENTIATOR: Rental-only CCRC with NO buy-in fees - extremely rare model combining CCRC continuum benefits with monthly rental accessibility. Church Homes, Inc. not-for-profit ownership. 43-acre campus is largest in research set. Over 50 years serving Hartford. Offers unique New England cottage housing option. Priority access to full care continuum without entrance fees makes this highly accessible compared to traditional CCRCs requiring $100K+ buy-ins."
}
