{
  "name": "Middlewoods of Farmington",
  "location": "Farmington, CT",
  "address": "509 Middle Road, Farmington, CT 06032",
  "description": "Small, home-like assisted living community with 73 apartments, affiliated with the University of Connecticut Health Center. Owned by United Methodist Homes, a faith-based non-profit, this intimate community offers relationship-centered care with unique benefits including on-site UConn geriatric physician and psychiatrist appointments, complimentary YMCA membership, and full kitchens in all apartments. Rated 9.4/10 by A Place for Mom, featuring wellness clinic with on-site RN, arts room, beauty salon, movie theater, and diverse fitness programming.",
  "community_type": "Independent Living & Assisted Living",
  "resident_count": 73,
  "star_rating": 9.4,
  "monthly_cost_min": 2280,
  "monthly_cost_max": 5474,
  "phone": "Contact facility for phone number",
  "website": "https://www.umh.org/middlewoods",
  "care_levels": [
    "Independent Living",
    "Assisted Living",
    "On-Site Medical Services (UConn Geriatric Physicians)",
    "On-Site Psychiatric Services (UConn Geriatric Psychiatrist)",
    "Wellness Clinic with RN"
  ],
  "housing_options": [
    "Efficiency Apartments with Kitchenettes",
    "One-Bedroom Apartments with Full Kitchens",
    "Two-Bedroom Apartments with Full Kitchens"
  ],
  "amenities": [
    "University of Connecticut Health Center Affiliation",
    "On-Site Geriatric Physician Appointments (UConn)",
    "On-Site Geriatric Psychiatrist Services (UConn)",
    "Complimentary YMCA Membership",
    "Full Kitchens in All Apartments",
    "Wellness Clinic with On-Site RN",
    "Arts Room",
    "Beauty Salon and Barber Shop",
    "Regular Movie Nights",
    "Community Movie Theater",
    "Transportation Services",
    "Parking Facilities",
    "Balance, Stretching & Strength Training Classes",
    "Yoga, Qigong, Tai Chi Classes",
    "Barre and Zumba Classes",
    "Podiatrist Clinic On-Site",
    "Hearing Clinic On-Site",
    "Medication Support",
    "Emergency Call System",
    "Community-Sponsored Activities"
  ],
  "financials_summary": "Middlewoods of Farmington offers monthly rental pricing averaging $3,910 (ranging from $2,280-$5,474 across sources) with no entrance fees, including 3 meals daily, weekly housekeeping and laundry, on-site wellness clinic with RN, and complimentary YMCA membership, all supported by United Methodist Homes' faith-based non-profit mission.",
  "care_summary": "Rated 9.4/10 by A Place for Mom, this United Methodist Homes community provides relationship-centered assisted living with unique UConn Health affiliation enabling on-site geriatric physician and psychiatrist appointments, plus podiatrist and hearing clinics, all in a small 73-apartment home-like setting.",
  "housing_summary": "The intimate 73-apartment community offers efficiency, one-bedroom, and two-bedroom units, each featuring full kitchens (unusual for assisted living), in-suite kitchenettes, emergency call systems, and various floor plans promoting independence and home-like comfort.",
  "community_summary": "Owned by United Methodist Homes and affiliated with UConn Health Center, this small Farmington community features complimentary YMCA membership, on-site arts room, beauty salon, movie theater, diverse fitness classes (yoga, qigong, tai chi, barre, Zumba, balance training), and easy access to UConn geriatric specialists, podiatry, and hearing services.",
  "data_confidence": {
    "address": "verified",
    "phone": "unknown",
    "pricing": "moderate",
    "care_levels": "high",
    "amenities": "high",
    "uconn_affiliation": "verified",
    "ymca_membership": "verified",
    "apartment_count": "verified"
  },
  "sources": [
    "https://www.umh.org/middlewoods",
    "https://www.umh.org/middlewoods-of-farmington/amenities",
    "Seniorly",
    "A Place for Mom (24 reviews)",
    "SeniorAdvisor",
    "Assisted Living Center",
    "Senior Care Homes",
    "Family Assets",
    "SeniorHousingNet",
    "MyCaringPlan"
  ],
  "notes": "UNIQUE: Only community in research set with UConn Health Center academic medical affiliation - on-site geriatric physicians and psychiatrists. Complimentary YMCA membership. Full kitchens in ALL apartments (rare for AL). Small 73-apartment intimate size. Faith-based non-profit (United Methodist Homes). 9.4/10 rating. On-site podiatrist and hearing clinics. Diverse fitness programming. Relationship-centered care. Pricing variance across sources ($2,280-$5,474) requires clarification. Phone number not readily available online. Year established unknown."
}
