{
  "name": "The McAuley",
  "location": "West Hartford, CT",
  "address": "275 Steele Road, West Hartford, CT 06117",
  "description": "West Hartford's only Life Plan Community (CCRC), celebrating its 30th Anniversary on a beautiful 26-acre campus adjacent to University of Saint Joseph. Voted Best in Independent Living by West Hartford Magazine for eight consecutive years, this Trinity Health Senior Communities facility partners with Saint Mary Home as 'The Mercy Community' to offer independent living, assisted living, rehabilitation, and advanced nursing care. Features unique wood shop, greenhouse, garden boxes, floral design space, art exhibitions, 19th hole golf lounge, and interfaith meditation room.",
  "community_type": "Life Plan Community / CCRC",
  "resident_count": 135,
  "star_rating": null,
  "monthly_cost_min": 5000,
  "monthly_cost_max": 6000,
  "phone": "(860) 920-6300",
  "website": "https://www.trinityhealthseniorcommunities.org/connecticut/the-mcauley",
  "care_levels": [
    "Independent Living",
    "Assisted Living",
    "Rehabilitation Services",
    "Advanced Nursing Care"
  ],
  "housing_options": [
    "Studio Apartments",
    "One-Bedroom Apartments",
    "Two-Bedroom Apartments",
    "Executive Suites",
    "Assisted Living Residences",
    "Pet-Friendly Residences"
  ],
  "amenities": [
    "26-Acre Campus",
    "Salon & Spa",
    "Fitness Center",
    "Resident Library",
    "19th Hole Lounge with Indoor/Outdoor Putting Greens",
    "Fireside Lounge",
    "Dining Room",
    "Interfaith Meditation Room",
    "Wood Shop",
    "Greenhouse",
    "Outdoor Garden Boxes",
    "Floral Design Space",
    "Art Exhibition Spaces",
    "Adjacent to University of Saint Joseph",
    "Near Elizabeth Park",
    "Minutes from West Hartford Center",
    "Transportation Services",
    "Multiple Dining Venues",
    "Cultural Programming",
    "Pet-Friendly Policies"
  ],
  "financials_summary": "The McAuley operates as a Life Plan Community with Life Care contracts averaging $5,369/month, slightly above West Hartford's $5,250 CCRC average, providing predictable lifetime costs and priority access to rehabilitation and nursing care through the Saint Mary Home partnership.",
  "care_summary": "Celebrating 30 years as West Hartford's only Life Plan Community, The McAuley offers Trinity Health System-backed care from independent living through advanced nursing via the Saint Mary Home partnership, with seamless transitions and long-term care coverage built into Life Care contracts.",
  "housing_summary": "The 26-acre campus features pet-friendly studios, one-bedroom, two-bedroom apartments, and executive suites for independent living, plus one dedicated assisted living floor, with most residents living independently in beautiful, modern residences.",
  "community_summary": "Voted Best in Independent Living by West Hartford Magazine for eight consecutive years, this 30-year Trinity Health community on 26 acres adjacent to University of Saint Joseph features a wood shop, greenhouse, garden boxes, floral design space, art exhibitions, 19th hole golf lounge, interfaith meditation room, and proximity to Elizabeth Park.",
  "data_confidence": {
    "address": "verified",
    "phone": "verified",
    "pricing": "moderate",
    "care_levels": "verified",
    "amenities": "verified",
    "campus_size": "verified",
    "awards": "verified"
  },
  "sources": [
    "https://www.trinityhealthseniorcommunities.org/connecticut/the-mcauley",
    "Trinity Health Senior Communities",
    "The Mercy Community",
    "Seniorly",
    "U.S. News Best Senior Living",
    "SeniorHousingNet",
    "SeniorAdvisor",
    "Senior Homes",
    "Caring.com",
    "Assisted Living Magazine"
  ],
  "notes": "West Hartford's ONLY Life Plan Community (exclusive CCRC positioning). 8 consecutive years voted Best in Independent Living by West Hartford Magazine. 30th Anniversary (established ~1995). Life Care contract model likely requires entrance fees (not publicly disclosed - transparency concern). Exceptional creative amenities: wood shop, greenhouse, floral design, art exhibitions. Unique 19th hole golf lounge. Trinity Health System affiliation. Partnership with Saint Mary Home for nursing care. Average $5,369/month above area average. Adjacent to University of Saint Joseph for cultural access. Near Elizabeth Park rose gardens."
}
